package Lesson_04;

import java.util.Scanner;

public class HomeWork_3_6 {
    public static void main(String[] args) {
//        Ввести с клавиатуры строку name.
//                Ввести с клавиатуры дату рождения (три числа): y, m, d.
//
//                Вывести на экран текст:
//        "Меня зовут name.
//        Я родился d.m.y"
//
//        Пример вывода:
//        Меня зовут Вася.
//                Я родился 15.2.1988

//        Scanner scanner = new Scanner(System.in);
//
//        String name = scanner.nextLine();
//
//        int d = scanner.nextInt();
//        int m = scanner.nextInt();
//        int y = scanner.nextInt();
//
//        System.out.printf("Меня зовут " + name + ".   Я родился " + d +"." + m + "." + y+ ".");
//    }







    }}

